---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.AsAggregate
source: html/abd9c207-2707-9dce-72c0-dda56cb0e96a.htm
---
# Autodesk.Revit.DB.IFC.IFCData.AsAggregate Method

Gets storage value as IFCAggregate when its PrimitiveType is aggregate.

## Syntax (C#)
```csharp
public IFCAggregate AsAggregate()
```

## Returns
The IFCAggregate.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The primitive type is not aggregate.